identification division.
program-id.accept.
environment division.
data division.
working-storage section.
77 a pic s9(3)v9(2) value 0.
77 b pic s9(3)v9(2) value 0.
77
